---
kind: method
id: M:Autodesk.Revit.DB.PanelTypeSet.Insert(Autodesk.Revit.DB.PanelType)
source: html/9277a424-eaa4-7f55-6e32-7c81b6288c5b.htm
---
# Autodesk.Revit.DB.PanelTypeSet.Insert Method

Insert the specified panel type into the set.

## Syntax (C#)
```csharp
public virtual bool Insert(
	PanelType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.PanelType`) - The panel type to be inserted into the set.

## Returns
Returns whether the panel type was inserted into the set.